src/cfd/Run/Allrun
#!/bin/sh
#phanquocthien.org

extrudeMesh
rm -f 0/*
cp 0.org/* 0/
foamRun -solver incompressibleFluid

foamToVTK
